IRP/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <attributes>
    <name>InfobaseUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>LocalizationCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowInList</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UserGroup</name>
    <type>
      <types>CatalogRef.UserGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>InterfaceLocalizationCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormScaleVariant</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Disable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangePasswordOnNextLogin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserID</name>
    <type>
      <types>DefinedType.typeBarcode</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchLiteral</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Users/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;

	PreviousInfobaseUserID = InfobaseUserID;
	AdminFunctionsPrivileged.CreateUser(ThisObject);
	If PreviousInfobaseUserID <> InfobaseUserID Then
		AdditionalProperties.Insert("isCreated", True);
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not Cancel Then
		If Disable Then
			User = InfoBaseUsers.FindByUUID(InfobaseUserID);
			If Not User = Undefined Then
				User.Delete();
			EndIf;
		EndIf;
		If Not Disable And AdditionalProperties.Property("isCreated") Then
			Result = New Structure("Success, ArrayOfResults", True, New Array());
			UsersEvent.UpdateUserRole(ThisObject.Ref, Result);
		EndIf;
	EndIf;
	
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure
